app/Controllers/CustomerController.php

SELECT *
FROM `customer`
WHERE `customer`.`customerID` = '12'
---
    public function showProfile($customerID)
    {
        $this->checkLogin(); // Pastikan user login

        $customerModel = new CustomerModel();
        $customer = $customerModel->find($customerID);