app/Controllers/FeedbackController.php

SELECT *
FROM `feedback`
---
public function viewFeedback()
{
    // Ambil data feedback dari model
    $feedbackModel = new \App\Models\FeedbackModel();
    $data['feedbacks'] = $feedbackModel->findAll(); // Atau sesuaikan dengan query sesuai kebutuhan