app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `email` = 'olipp@itb.com'
 LIMIT 1
---
    public function loginAdmin($email, $password)
    {
        $admin = $this->where('email', $email)->first();